Revit 2027 API
PipeSettings.AddPipeSlope Method
 Add a pipe slope value.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddPipeSlope(
	double slope
)
Public Sub AddPipeSlope (
	slope As Double
)
public:
void AddPipeSlope(
	double slope
)
member AddPipeSlope :
        slope : float -> unit
Parameters
slope Double
 The pipe slope value. Revit stores the slope value as a percentage (0-100).
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The given value for slope must be between 0 and 100. Slope value is stored in percentage. e.g. 100 means 100%, and it is 45 degree.
InvalidOperationException |  Can not add a pipe slope value that was already added.
See Also
Reference
PipeSettings Class
Autodesk.Revit.DB.Plumbing Namespace